## Infrastructure Pipeline Results

### Stage 1: Terraform Validation
✅ **Format Check**: Passed
✅ **Terraform Init**: Passed
✅ **Terraform Validate**: Passed

### Stage 2: Security Scan
✅ **Checkov Scan**: Completed (check Security tab for details)

### Stage 3: Terraform Plan
✅ **Plan Status**: Succeeded

<details>
<summary>📋 Show Plan Output</summary>

```terraform
To view this run in a browser, visit:
https://app.terraform.io/app/Kolayemi-org/muykol-chatbot-dev/runs/run-Xz4tzTjPgF9eF5Aa

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cognito.aws_cloudwatch_log_group.cognito_logs will be created
  + resource "aws_cloudwatch_log_group" "cognito_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/cognito/muykol-chatbot"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Name" = "muykol-chatbot-cognito-logs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-cognito-logs"
          + "Project"     = "muykol-chatbot"
        }
    }

  # module.cognito.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "muykol-chatbot-user-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "muykol-chatbot-user-pool"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-user-pool"
          + "Project"     = "muykol-chatbot"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + device_configuration {
          + challenge_required_on_new_device      = false
          + device_only_remembered_on_user_prompt = false
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = false
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "family_name"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "given_name"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "prayer_consent"
          + required                 = false

          + string_attribute_constraints {
              + max_length = "10"
              + min_length = "1"
            }
        }

      + user_pool_add_ons {
          + advanced_security_mode = "ENFORCED"
        }

      + verification_message_template {
          + default_email_option  = "CONFIRM_WITH_CODE"
          + email_message         = "Welcome to Faith Motivator! Your verification code is {####}"
          + email_message_by_link = (known after apply)
          + email_subject         = "Faith Motivator - Verify your email"
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.cognito.aws_cognito_user_pool_client.web_client will be created
  + resource "aws_cognito_user_pool_client" "web_client" {
      + access_token_validity                         = 60
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "http://localhost:3000/auth/callback",
          + "https://dev.faithchatbot.com/auth/callback",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = false
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = 60
      + logout_urls                                   = [
          + "http://localhost:3000/",
          + "https://dev.faithchatbot.com/",
        ]
      + name                                          = "muykol-chatbot-web-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = [
          + "custom:prayer_consent",
          + "email",
          + "email_verified",
          + "family_name",
          + "given_name",
        ]
      + refresh_token_validity                        = 43200
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = [
          + "custom:prayer_consent",
          + "email",
          + "family_name",
          + "given_name",
        ]

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "minutes"
        }
    }

  # module.cognito.aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "auth-faithchatbot-dev"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.dynamodb.aws_cloudwatch_metric_alarm.user_profiles_throttle will be created
  + resource "aws_cloudwatch_metric_alarm" "user_profiles_throttle" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DynamoDB UserProfiles table throttling"
      + alarm_name                            = "muykol-chatbot-user-profiles-throttle"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "TableName" = "muykol-chatbot-UserProfiles"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ThrottledRequests"
      + namespace                             = "AWS/DynamoDB"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name" = "muykol-chatbot-user-profiles-throttle-alarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-user-profiles-throttle-alarm"
          + "Project"     = "muykol-chatbot"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.dynamodb.aws_dynamodb_table.consent_logs will be created
  + resource "aws_dynamodb_table" "consent_logs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "log_id"
      + id               = (known after apply)
      + name             = "muykol-chatbot-ConsentLogs"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "muykol-chatbot-consent-logs"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-consent-logs"
          + "Project"     = "muykol-chatbot"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "log_id"
          + type = "S"
        }
      + attribute {
          + name = "timestamp"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "timestamp"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # module.dynamodb.aws_dynamodb_table.conversation_sessions will be created
  + resource "aws_dynamodb_table" "conversation_sessions" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "session_id"
      + id               = (known after apply)
      + name             = "muykol-chatbot-ConversationSessions"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "muykol-chatbot-conversation-sessions"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-conversation-sessions"
          + "Project"     = "muykol-chatbot"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "created_at"
          + type = "S"
        }
      + attribute {
          + name = "session_id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "created_at"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

  # module.dynamodb.aws_dynamodb_table.prayer_requests will be created
  + resource "aws_dynamodb_table" "prayer_requests" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "request_id"
      + id               = (known after apply)
      + name             = "muykol-chatbot-PrayerRequests"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "muykol-chatbot-prayer-requests"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-prayer-requests"
          + "Project"     = "muykol-chatbot"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "created_at"
          + type = "S"
        }
      + attribute {
          + name = "request_id"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "status"
          + name               = "StatusIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "created_at"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "created_at"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # module.dynamodb.aws_dynamodb_table.user_profiles will be created
  + resource "aws_dynamodb_table" "user_profiles" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "user_id"
      + id               = (known after apply)
      + name             = "muykol-chatbot-UserProfiles"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "muykol-chatbot-user-profiles"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-user-profiles"
          + "Project"     = "muykol-chatbot"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "email"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "email"
          + name               = "EmailIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # module.dynamodb.aws_kms_alias.dynamodb will be created
  + resource "aws_kms_alias" "dynamodb" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/muykol-chatbot-dynamodb"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.dynamodb.aws_kms_key.dynamodb will be created
  + resource "aws_kms_key" "dynamodb" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for DynamoDB encryption"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "muykol-chatbot-dynamodb-key"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-dynamodb-key"
          + "Project"     = "muykol-chatbot"
        }
    }

  # module.dynamodb.aws_sns_topic.dynamodb_alerts will be created
  + resource "aws_sns_topic" "dynamodb_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "muykol-chatbot-dynamodb-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Name" = "muykol-chatbot-dynamodb-alerts"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-dynamodb-alerts"
          + "Project"     = "muykol-chatbot"
        }
      + tracing_config              = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "muykol-chatbot-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "muykol-chatbot-ecs-task-execution-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-ecs-task-execution-role"
          + "Project"     = "muykol-chatbot"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "muykol-chatbot-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "muykol-chatbot-ecs-task-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-ecs-task-role"
          + "Project"     = "muykol-chatbot"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "muykol-chatbot-lambda-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "muykol-chatbot-lambda-execution-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-lambda-execution-role"
          + "Project"     = "muykol-chatbot"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy.ecs_task_execution_additional will be created
  + resource "aws_iam_role_policy" "ecs_task_execution_additional" {
      + id          = (known after apply)
      + name        = "muykol-chatbot-ecs-task-execution-additional"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:724604039557:secret:muykol-chatbot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:ViaService" = "secretsmanager.us-east-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:kms:us-east-1:724604039557:key/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy.ecs_task_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_policy" {
      + id          = (known after apply)
      + name        = "muykol-chatbot-ecs-task-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "bedrock:InvokeModel",
                          + "bedrock:InvokeModelWithResponseStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:bedrock:us-east-1::foundation-model/anthropic.claude-3-sonnet-20240229-v1:0",
                          + "arn:aws:bedrock:us-east-1::foundation-model/amazon.titan-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:BatchGetItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:724604039557:table/muykol-chatbot-*",
                          + "arn:aws:dynamodb:us-east-1:724604039557:table/muykol-chatbot-*/index/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:GetQueueAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:724604039557:muykol-chatbot-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ses:us-east-1:724604039557:identity/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-1:724604039557:log-group:/ecs/muykol-chatbot:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id          = (known after apply)
      + name        = "muykol-chatbot-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessage",
                          + "sqs:GetQueueAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:724604039557:muykol-chatbot-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:724604039557:table/muykol-chatbot-*",
                          + "arn:aws:dynamodb:us-east-1:724604039557:table/muykol-chatbot-*/index/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ses:us-east-1:724604039557:identity/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:724604039557:secret:muykol-chatbot/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "muykol-chatbot-ecs-task-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "muykol-chatbot-lambda-execution-role"
    }

  # module.sqs.aws_cloudwatch_metric_alarm.prayer_requests_dlq_messages will be created
  + resource "aws_cloudwatch_metric_alarm" "prayer_requests_dlq_messages" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Messages in prayer requests DLQ"
      + alarm_name                            = "muykol-chatbot-prayer-requests-dlq-messages"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "muykol-chatbot-PrayerRequests-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfVisibleMessages"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "muykol-chatbot-prayer-requests-dlq-alarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-prayer-requests-dlq-alarm"
          + "Project"     = "muykol-chatbot"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.sqs.aws_cloudwatch_metric_alarm.prayer_requests_queue_depth will be created
  + resource "aws_cloudwatch_metric_alarm" "prayer_requests_queue_depth" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Prayer requests queue depth is high"
      + alarm_name                            = "muykol-chatbot-prayer-requests-queue-depth"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "muykol-chatbot-PrayerRequests"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfVisibleMessages"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name" = "muykol-chatbot-prayer-requests-queue-depth-alarm"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-prayer-requests-queue-depth-alarm"
          + "Project"     = "muykol-chatbot"
        }
      + threshold                             = 100
      + treat_missing_data                    = "missing"
    }

  # module.sqs.aws_kms_alias.sqs will be created
  + resource "aws_kms_alias" "sqs" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/muykol-chatbot-sqs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.sqs.aws_kms_key.sqs will be created
  + resource "aws_kms_key" "sqs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for SQS encryption"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::724604039557:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sqs.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow SQS service"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "muykol-chatbot-sqs-key"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-sqs-key"
          + "Project"     = "muykol-chatbot"
        }
    }

  # module.sqs.aws_sns_topic.sqs_alerts will be created
  + resource "aws_sns_topic" "sqs_alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "muykol-chatbot-sqs-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Name" = "muykol-chatbot-sqs-alerts"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-sqs-alerts"
          + "Project"     = "muykol-chatbot"
        }
      + tracing_config              = (known after apply)
    }

  # module.sqs.aws_sqs_queue.prayer_requests will be created
  + resource "aws_sqs_queue" "prayer_requests" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "muykol-chatbot-PrayerRequests"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name" = "muykol-chatbot-prayer-requests"
        }
      + tags_all                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-prayer-requests"
          + "Project"     = "muykol-chatbot"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.sqs.aws_sqs_queue.prayer_requests_dlq will be created
  + resource "aws_sqs_queue" "prayer_requests_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "muykol-chatbot-PrayerRequests-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name" = "muykol-chatbot-prayer-requests-dlq"
        }
      + tags_all                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-prayer-requests-dlq"
          + "Project"     = "muykol-chatbot"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.sqs.aws_sqs_queue_policy.prayer_requests_policy will be created
  + resource "aws_sqs_queue_policy" "prayer_requests_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.vpc.aws_cloudwatch_log_group.vpc_flow_log will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/flowlogs/muykol-chatbot"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Name" = "muykol-chatbot-vpc-flow-logs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-vpc-flow-logs"
          + "Project"     = "muykol-chatbot"
        }
    }

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = []
      + id                     = (known after apply)
      + ingress                = []
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "muykol-chatbot-default-sg-restricted"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-default-sg-restricted"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_flow_log.vpc_flow_log will be created
  + resource "aws_flow_log" "vpc_flow_log" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Project"     = "muykol-chatbot"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_role.flow_log will be created
  + resource "aws_iam_role" "flow_log" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "muykol-chatbot-vpc-flow-log-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Project"     = "muykol-chatbot"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc.aws_iam_role_policy.flow_log will be created
  + resource "aws_iam_role_policy" "flow_log" {
      + id          = (known after apply)
      + name        = "muykol-chatbot-vpc-flow-log-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-1:724604039557:log-group:/aws/vpc/flowlogs/muykol-chatbot",
                          + "arn:aws:logs:us-east-1:724604039557:log-group:/aws/vpc/flowlogs/muykol-chatbot:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.vpc.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "muykol-chatbot-igw"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-igw"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "muykol-chatbot-private-rt-1"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-private-rt-1"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "muykol-chatbot-public-rt"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-public-rt"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from internet (redirect to HTTPS only)"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "muykol-chatbot-alb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "muykol-chatbot-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-alb-sg"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS to internet for external APIs"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "172.20.0.0/20",
                ]
              + description      = "DNS resolution"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "To VPC endpoints"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "From ALB on port 8000"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "muykol-chatbot-ecs-tasks-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "muykol-chatbot-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-ecs-tasks-sg"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_security_group.lambda will be created
  + resource "aws_security_group" "lambda" {
      + arn                    = (known after apply)
      + description            = "Security group for Lambda functions (prepared for future use)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS to internet for external APIs"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "172.20.0.0/20",
                ]
              + description      = "DNS resolution"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "To VPC endpoints"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "muykol-chatbot-lambda-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "muykol-chatbot-lambda-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-lambda-sg"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database (prepared for future use)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "From ECS tasks"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "From Lambda functions"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "muykol-chatbot-rds-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "muykol-chatbot-rds-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-rds-sg"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn          

... (truncated)
```

</details>

---

**Next Steps:**
- Review the plan output above
- Check security scan results in the Security tab
- If everything looks good, approve and merge this PR
- Terraform Apply will run automatically after merge
